---
kind: method
id: M:Autodesk.Revit.DB.TableCellStyle.#ctor(Autodesk.Revit.DB.TableCellStyle)
source: html/ec5143e1-eb6c-2539-ae7c-78daf926bed5.htm
---
# Autodesk.Revit.DB.TableCellStyle.#ctor Method

Constructs a new copy of the input TableCellStyle object.

## Syntax (C#)
```csharp
public TableCellStyle(
	TableCellStyle other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.TableCellStyle`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null